Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: On systems which involve a Podman Machine managed VM (Mac & Windows), container clients and Podman commands communicate remotely to either a rootful or rootless system service running the VM. Which is used is determined by the `rootful` setting of the Podman machine. For maximal compatibility, Podman Desktop defaults to enabling rootful for new machine instances. There is limited security impact to this since the VM itself is running under a user process. This can also be changed via the podman commands:
ja_jp: Podmanマシンが管理するVM（MacとWindows）を含むシステムでは、コンテナクライアントとPodmanコマンドはVMを実行しているルートフルまたはルートレスシステムサービスにリモートで通信します。どちらを使用するかは、Podmanマシンの `rootful` 設定によって決まります。最大限の互換性を実現するため、Podman Desktopのデフォルトでは、新しいマシンインスタンスに対してrootfulを有効にします。VM自体はユーザープロセスで実行されるため、セキュリティへの影響は限定的です。これはpodmanコマンドで変更することもできます：

source: On that resulting page, copy the `Client Id` (under `Application (client) ID`, then click on `Add a certificate or secret`:
ja_jp: その結果のページで、 `Client Id` (`Application (client) ID` の下) をコピーしてから、 `Add a certificate or secret` をクリックします。

source: On the Javascript side, you have access to all the pages (in case you want to create links)
ja_jp: Javascript 側では、すべてのページにアクセスできます (リンクを作成する必要がある場合)。

source: On the Quarkus side, we are also working on:
ja_jp: Quarkus 側では、以下の点にも取り組んでいます。

source: On the `Quickstart` page click on `Facebook login > Settings` on the left menu:
ja_jp: クイックスタートページで、左側のメニューの `Facebook login > Settings` をクリックします。

source: On the app page, click `Set up` on the `Facebook login` product:
ja_jp: アプリページで、 `Facebook login` 製品の `Set up` をクリックします。

source: On the client side, the transaction support also needs to be enabled on `PulsarClient` configuration:
ja_jp: クライアント側でも、 `PulsarClient` 設定でトランザクションのサポートを有効にする必要があります。

source: On the client-side, our Quarkus application uses the REST Client Reactive to interact with the REST API exposed by the `rest-service`. The Client app uses Stork to discover the rest-service instances. The easiest way to enable Stork is to add the corresponding Jar to the classpath of your project:
ja_jp: クライアント側では、QuarkusアプリケーションがREST Client Reactiveを使用して、 `rest-service` が公開するREST APIと対話します。クライアントアプリは、Storkを使用してrest-serviceのインスタンスを検出します。Storkを有効にする最も簡単な方法は、対応するJarをプロジェクトのクラスパスに追加することです。

source: On the flip side it is NOT possible to create new channels programmatically at runtime. There are, however, many patterns that let you implement most, if not all, messaging and integration use cases:
ja_jp: その一方で、実行時にプログラムで新しいチャネルを作成することはできません。 ただし、すべてではないにしても、ほとんどのメッセージングおよびインテグレーションユースケースを実装できるパターンは多数あります。

source: On the following example we have a class with a method implementing a manual span with a custom attribute. The only business logic we are measuring there is the `return "Hello from Quarkus REST";` statement.
ja_jp: 以下の例では、カスタム属性を持つ手動スパンを実装するメソッドを持つクラスがあります。そこで計測している唯一のビジネスロジックは、 `return "Hello from Quarkus REST";` ステートメントです。

source: On the inbound side (receiving messages from RabbitMQ), the check verifies that the receiver is connected to the broker.
ja_jp: インバウンド側 (RabbitMQ からのメッセージを受信) では、チェックにより受信者がブローカーに接続されていることを確認します。

source: On the last screen click on Finish
ja_jp: 最後の画面でFinishをクリックします。

source: On the next Quarkus Insights episode, we are trying something new.
ja_jp: 次のQuarkus Insightsのエピソードでは、新しいことを試しています。

source: On the other hand, Quarkus OIDC uses a dedicated `q_auth_<uuid>` state cookie while the authorization code flow is in progress and only creates a session cookie once the code flow is complete. The state cookie names are also unique allowing for a multi-tab authentication.
ja_jp: 一方、Quarkus OIDC は、認可コードフローの進行中は専用の `q_auth_<uuid>` 状態クッキーを使用し、コードフローが完了した後にのみセッションクッキーを作成します。状態クッキーの名前も一意であるため、マルチタブ認証が可能です。

source: On the other hand, `quarkus.oidc.token.require-jwt-introspection-only` enforces that a decision as to whether the current JWT token is valid or not can only be taken by the OIDC provider itself, for example, in order to immediately recognize that the current token has already been revoked, etc. In this case you would also likely disable the discovery with `quarkus.oidc.discovery-enabled=false` to prevent Quarkus discovering the JWKs endpoint and fetching the verification keys which are not going to be used anyway.
ja_jp: 一方で、`quarkus.oidc.token.require-jwt-introspection-only` は、現在の JWT トークンが有効かどうかの判断を OIDC プロバイダー自身のみが行うように強制します。これは例えば、現在のトークンが既に失効していることを即座に認識したい場合などに有効です。この場合、Quarkus が JWKs エンドポイントを検出して、結局使用されない検証キーを取得するのを防ぐために、`quarkus.oidc.discovery-enabled=false` でディスカバリーも無効にすることが一般的です。

source: On the other hand, going native significantly reduces the container image size, since you no longer need to include the full JVM.
ja_jp: 一方、ネイティブ化すると、完全な JVM を含める必要がなくなるため、Container Image サイズが大幅に削減されます。

source: On the other hand, some messaging-related extensions propose low-level provider-specific integrations. The level of support covered on this page DOES NOT involve these low-level extensions. A non-exhaustive list of this kind of extension are the following:
ja_jp: 一方、メッセージング関連のエクステンションの中には、低レベルのプロバイダー固有のインテグレーションを提案するものもあります。 このページで説明されているサポートレベルには、これらの低レベルのエクステンションは含まれません。 以下は、この種のエクステンションの一部を含むリストです。

source: On the other hand, this example:
ja_jp: 一方、以下の例では、

source: On the other hand, you can fully customize the roles, subjects and role bindings to generate using the properties under `quarkus.kubernetes.rbac.role-bindings`, and if present, the `kubernetes-client` extension will use it and hence won't generate any RoleBinding resource.
ja_jp: 一方、 `quarkus.kubernetes.rbac.role-bindings` のプロパティーを使用して、生成するロール、サブジェクト、ロールバインディングを完全にカスタマイズすることができます。もし存在すれば、 `kubernetes-client` エクステンションはそれを使用するので、RoleBindingリソースは生成しません。

source: On the other hand, you cannot mock `@Singleton` beans using <<getting-started-testing.adoc#quarkus_mock,QuarkusMock>>.
ja_jp: 一方、<<getting-started-testing.adoc#quarkus_mock,QuarkusMock>> を使用して `@Singleton` Bean を模倣できません。

source: On the other hand, you cannot mock `@Singleton` beans using xref:getting-started-testing.adoc#quarkus_mock[QuarkusMock].
ja_jp: 一方、 xref:getting-started-testing.adoc#quarkus_mock[QuarkusMock] を使用して `@Singleton` Beanをモックすることはできません。

source: On the other side, the reactive model relies on non-blocking I/Os and a different execution model. Non-blocking I/O provides an efficient way to deal with concurrent I/O. A minimal amount of threads called I/O threads, can handle many concurrent I/O. With such a model, request processing is not delegated to a worker thread but uses these I/O threads directly.It saves memory and CPU as there is no need to create worker threads to handle the requests. It also improves the concurrency as it removes the constraint on the number of threads. Finally, it also improves response time as it reduces the number of thread switches.
ja_jp: 一方、リアクティブモデルは、ノンブロッキングI/Oおよび、異なる実行モデルに依存しています。ノンブロッキングI/Oは、同時I/Oを効率的に処理する方法です。I/Oスレッドと呼ばれる最小限のスレッドで、多くの同時I/Oを処理することができます。このようなモデルでは、リクエスト処理をワーカースレッドに委ねるのではなく、I/Oスレッドを直接使用します。リクエストを処理するためにワーカースレッドを作成する必要がないため、メモリとCPUを節約できます。リクエストを処理するためにワーカスレッドを作成する必要がないため、メモリやCPUを節約できます。また、スレッド数の制約がなくなるため、同時実行性も向上します。最後に、スレッドの切り替え回数が減ることで、応答時間も改善されます。

source: On the outbound side (sending records to RabbitMQ), the check verifies that the sender is not disconnected from the broker; the sender _may_ still be in an initialised state (connection not yet attempted), but this is regarded as live/ready.
ja_jp: アウトバウンド側 (RabbitMQ にレコードを送信) では、チェックにより、送信者がブローカーから切断されていないことを確認します。送信者は初期化された状態 (接続は未試行) の_可能性_がありますが、これはlive/ready と見なされます。

source: On the outbound side (sending records to RabbitMQ), the check verifies that the sender is not disconnected from the broker; the sender _may_ still be in an initiliased state (connection not yet attempted), but this is regarded as live/ready.
ja_jp: 送信側（RabbitMQへのレコード送信）では、送信者がブローカーから切断されていないことを確認します。送信者はまだinitiliased状態（接続未試行） _かも_ しれませんが、これはlive/readyとみなされます。

source: On the resulting page, copy your `Secret Value`:
ja_jp: 結果のページで、 `Secret ID` をコピーします。

source: On the same extensions
ja_jp: 同じエクステンションについて

source: On the same topics
ja_jp: 同じトピックについて

source: On the server side, the `info` log show what OptaPlanner did in those five seconds:
ja_jp: サーバー側では、 `info` ログに OptaPlanner が 5 秒間で何をしたかが示されます。

source: On these page we show the signal independent features of the extension.
ja_jp: このページでは、シグナルに依存しないエクステンション機能について説明します。

source: On this page we show the signal independent features of the extension.
ja_jp: このページでは、エクステンションのシグナルに依存しない機能について説明します。

source: On this section we have a new class, the `HistogramResource` that will create a `LongHistogram`.
ja_jp: このセクションには、る新しいクラス `HistogramResource` があり、このクラスは `LongHistogram` を作成します。

source: On top of immutable data, in certain contexts it might be acceptable to enable caching also on mutable data; this could be a necessary tradeoff on selected entities which are read frequently and for which some degree of staleness is acceptable; this " acceptable degree of staleness" can be tuned by setting eviction properties. This is however not recommended and should be done with extreme care, as it might produce unexpected and unforeseen effects on the data.
ja_jp: 不変のデータだけでなく、ある文脈では、可変のデータに対してもキャッシュを有効にすることが許容されるかもしれません。これは、頻繁に読み込まれ、ある程度の陳腐化を許容できるようなエンティティを選択した場合、必要なトレードオフとなり得ます。この「許容される陳腐化の度合い」は、eviction プロパティーを設定することで調整できます。しかし、これは推奨されておらず、データに予期せぬ影響を与える可能性があるため、細心の注意を払って行う必要があります。

source: On top of that, each extension can add:
ja_jp: その上で、各エクステンションは以下を追加することができます。

source: On top of that, the Blaze-Persistence Entity-View module allows for DTO definitions that can be applied to business logic queries which are then transformed to optimized queries that only fetch the data that is needed to construct the DTO instances. The same DTO definitions can further be used for applying database updates, leading to a great reduction in boilerplate code and removing the need for object mapping tools.
ja_jp: さらに、Blaze-Persistence Entity-Viewモジュールは、ビジネスロジッククエリに適用出来るDTO定義を可能にし、そのクエリはDTOインスタンスを構築するために必要なデータのみを取得する最適化されたクエリに変換されます。同じDTO定義をデータベースの更新にも使用することができます。これにより、ボイラプレートコードが大幅に削減され、オブジェクトマッピングツールの必要性がなくなります。

source: On top of the parametric configuration, you can also programmatically apply additional configuration to the client by implementing a `RestClientBuilder.HttpClientConfigCallback` and annotating it with `ElasticsearchClientConfig`. You may provide multiple implementations and configuration provided by each implementation will be applied in a randomly ordered cascading manner.
ja_jp: パラメーターによる設定に加えて、 `RestClientBuilder.HttpClientConfigCallback` を実装して `ElasticsearchClientConfig` とアノテーションを付けることで、追加の設定をプログラムでクライアントに適用することもできます。複数の実装を追加することができ、各実装で提供された設定はランダムに順序付けられたカスケード方式で適用されます。

source: On top of the shoulders of 2.0, 2.1 includes a lot of refinements and improvements all over the place.
ja_jp: 2.0の上に、2.1は多くの改良と改善が至る所に含まれています。

source: OnOpen and OnClose methods
ja_jp: OnOpen および OnClose メソッド

source: Onboarding __and__ ramp-up takes days instead of weeks
ja_jp: オンボーディング __と__ ランプアップは、数週間ではなく数日で完了します。

source: Onboarding more easily and more quickly new technologies (either applicative frameworks, or middleware products).
ja_jp: 新しい技術（アプリケーション・フレームワークやミドルウェア製品）をより簡単に、より早く導入する。

source: Once 3.31 is released, you will also be able to switch your existing applications to the new packaging by applying the following changes:
ja_jp: 3.31がリリースされたら、既存のアプリケーションを新しいパッケージングに切り替えるために、以下の変更を適用することもできます。

source: Once GZip support has been enabled you can use it on an endpoint by adding the `@org.jboss.resteasy.annotations.GZIP` annotation to your endpoint method.
ja_jp: GZip サポートが有効になったら、エンドポイントメソッドに `@org.jboss.resteasy.annotations.GZIP` アノテーションを追加することで、エンドポイントで使用することができます。

source: Once GZip support has been enabled, you can use it on an endpoint by adding the `@org.jboss.resteasy.annotations.GZIP` annotation to your endpoint method.
ja_jp: GZip サポートが有効になったら、エンドポイントメソッドに `@org.jboss.resteasy.annotations.GZIP` アノテーションを追加することで、エンドポイントで GZip サポートを使用できます。

source: Once Stork is configured, we need to configure the REST Client to use it. It can be done in the `@RegisterRestClient` annotated interface by adding the `baseUri` attribute with the `stork://` scheme:
ja_jp: Storkを設定したら、それを使用するためにRESTクライアントを設定する必要があります。これは、 `@RegisterRestClient` アノテーションされたインターフェイスで、 `stork://` スキームで `baseUri` 属性を追加することで行うことができます。

source: Once `instance` is built, `export` is initialized with a `K8sCel_ModuleExports` instance, providing exported functions which are called later in the `validate()` method.
ja_jp: `instance` が構築されると、 `export` は `K8sCel_ModuleExports` インスタンスで初期化され、後に `validate()` メソッドで呼び出されるエクスポート関数を提供します。

source: Once a custom target definition is added the `+connectUrl+` can be used as a `+targetId+` URL parameter anywhere one is expected in the Cryostat HTTP API.
ja_jp: `targetId` カスタムターゲット定義が追加されると、 `connectUrl` URLパラメータとして、Cryostat HTTP APIで期待される任意の場所で使用することができます。

source: Once added to your project, you can map _channels_ to AMQP addresses by configuring the `connector` attribute:
ja_jp: プロジェクトに追加したら、 `connector` 属性を設定することで、_channels_ を AMQP アドレスにマッピングできます。

source: Once added to your project, you can map _channels_ to RabbitMQ exchanges or queues by configuring the `connector` attribute:
ja_jp: プロジェクトに追加したら、 `connector` 属性を設定することで、_チャネル_ を RabbitMQ エクスチェンジまたはキューにマップできます。

source: Once added, open the Dev UI to start using the assistant.
ja_jp: 追加したら、 Dev UI を開いてアシスタントの使用を開始してください。

source: Once again, this means that at build time, a subclass of `MyClass` is generated that does the interception and forwarding.
ja_jp: つまり、これはビルド時に、インターセプトと転送を行う `MyClass` のサブクラスが生成されることを意味します。

source: Once all v2 messages are consumed, optionally switch to `Default4ByteIdHandler`
ja_jp: すべての v2 メッセージが消費されたら、オプションで `Default4ByteIdHandler` に切り替えます。

source: Once an object is placed within an STM container the application developer can manage the scope of transactions within which it is used. There are some annotations which can be applied to the STM-aware class to have the container automatically create a transaction whenever a specific method is invoked.
ja_jp: 一度オブジェクトをSTMコンテナー内に配置すると、アプリケーション開発者はそれが使用されるトランザクションの範囲を管理することができます。特定のメソッドが呼び出されたときにコンテナーが自動的にトランザクションを作成するように、STM-aware クラスに適用できるアノテーションがいくつかあります。

source: Once both the application and tracing system are started, you can make a request to the provided endpoint:
ja_jp: アプリケーションとトレースシステムの両方が起動したら、提供されたエンドポイントにリクエストを行うことができます:

source: Once class loading is out of the picture, it becomes clear that a significant portion of startup time is spent loading service descriptors from JAR files. We managed to improve this for some services using a class loader trick, but that only works for services loaded through the thread context class loader. We don't yet have a good solution for services loaded by the JDK class loaders. At least not for now.
ja_jp: クラスロードが問題にならなくなると、起動時間のかなりの部分が JAR ファイルからのサービス記述子のロードに費やされていることが明らかになります。私たちはクラスローダーのトリックを使って一部のサービスでこれを改善できましたが、それはスレッドコンテキストクラスローダーを通じてロードされるサービスに対してのみ有効です。JDK クラスローダーによってロードされるサービスについては、まだ良い解決策がありません。少なくとも今のところは。

source: Once created, the PR will be tagged automatically as something containing documentation changes.
ja_jp: 一度作成された PR は、ドキュメントを含む何かが変更されると、自動的にタグ付けされます。

source: Once data and models are ready, enterprises need applications that:
ja_jp: データとモデルの準備ができたら、企業は次のようなアプリケーションを必要とします。

source: Once defined, the `mydatabase` provider can be used in any extension that supports the `Credentials Provider` interface. For instance in `agroal`:
ja_jp: 一度定義すると、 `mydatabase` プロバイダーは `Credentials Provider` インターフェイスをサポートするすべてのエクステンションで使用することができます。例えば、 `agroal` の場合次のようになります:

source: Once deployed, the application will be running on whatever port is used to expose the service. By default, Quarkus apps run on port 8080 internally.
ja_jp: デプロイされると、アプリケーションは、サービスを公開するために使用されるポートであれば何でも実行されます。デフォルトでは、Quarkusアプリケーションは内部的にポート8080で実行されます。

source: Once enabled, Quarkus starts a new OIDC server that supports most common OpenID Connect operations. You can confirm in your console that the OIDC server started, you will see output similar to the following:
ja_jp: 有効にすると、Quarkus は最も一般的な OpenID Connect 操作をサポートする新しい OIDC サーバーを起動します。 OIDC サーバーが起動したことをコンソールで確認すると、次のような出力が表示されます。

source: Once enabled, you can use same authentication mechanism you have already configured for the main server, or use a different one. All of these mechanisms are detailed in the xref:security-authentication-mechanisms.adoc[Authentication mechanisms in Quarkus] guide.
ja_jp: 有効にすると、メインサーバーにすでに設定されているものと同じ認証メカニズムを使用することも、別の認証メカニズムを使用することもできます。 これらのメカニズムはすべて、xref:security-authentication-mechanisms.adoc[Quarkus の認証メカニズム] ガイドで詳しく説明されています。

source: Once generated, look at the `pom.xml`. You will find the import of the Quarkus BOM, allowing you to omit the version of the different Quarkus dependencies. In addition, you can see the `quarkus-maven-plugin` responsible of the packaging of the application and also providing the development mode.
ja_jp: 生成されたら、 `pom.xml` を確認してください。 Quarkus の BOM のインポートが存在することが分かります。これにより、異なる Quarkus の依存関係のバージョンを省略できます。さらに、アプリケーションのパッケージングと開発モードを処理する `quarkus-maven-plugin` が存在することが分かります。

source: Once generated, look at the `quarkusapp.java` file.
ja_jp: 生成された `quarkusapp.java` ファイルを確認します。

source: Once generated, you can look at the `target/generated-sources/grpc` directory:
ja_jp: 生成されたら、 `target/generated-sources/grpc` ディレクトリーを見てみましょう。

source: Once generated, you can look at the `target/kubernetes` directory:
ja_jp: 生成されたら、 `target/kubernetes` ディレクトリーを確認します。

source: Once injected, you can use the `log` object to invoke logging methods.
ja_jp: 注入された後は、 `log` オブジェクトを使用してロギングメソッドを呼び出すことができます。

source: Once installed `quarkus` will be in your `$PATH` and if you run `quarkus --version` it will print the installed version:
ja_jp: インストールされた `quarkus` は `$PATH` に配置され、 `quarkus --version` を実行するとインストールされているバージョンが出力されます。

source: Once installed you can create a project by executing
ja_jp: インストールしたら、次のようにしてプロジェクトを作成します。

source: Once installed, ensure you are authenticated:
ja_jp: インストールしたら、認証されていることを確認してください。

source: Once packaged, run `docker compose up --build`. The UI is exposed on http://localhost:8080/quotes.html
ja_jp: パッケージ化したら、 `docker compose up --build` を実行します。UI は http://localhost:8080/quotes.html で公開されています

source: Once packaged, run `docker-compose up`.
ja_jp: パッケージ化したら、 `docker-compose up` を実行します。

source: Once selected, click on "Generate your application", download the zip file, unzip it and open the code in your favorite IDE.
ja_jp: 選択したら、"Generate your application "をクリックし、zipファイルをダウンロードして解凍し、お好みのIDEでコードを開きます。

source: Once started, you can request the provided endpoint:
ja_jp: アプリケーションが起動したら、提供されたエンドポイントにリクエストを送信することができます。

source: Once the Let's Encrypt certificate chain and private key have been successfully renewed, they are converted to PEM format and copied to your application's `.letsencrypt` folder. The TLS registry is notified when a new certificate and private key are ready, and it automatically reloads them.
ja_jp: Let's Encrypt 証明書チェーンと秘密鍵が正常に更新されると、それらは PEM フォーマットに変換され、アプリケーションの `.letsencrypt` フォルダーにコピーされます。 TLS レジストリーには、新しい証明書と秘密鍵の準備ができたことが通知され、それらの自動リロードが実行されます。

source: Once the application is up, visit http://localhost:8080/hello. It should show a "Hello from Quarkus REST" message.
ja_jp: アプリケーションが起動したら、 http://localhost:8080/hello にアクセスします。"Hello from Quarkus REST" というメッセージが表示されます。

source: Once the bearer JWT token's signature has been verified and its `expires at` (`exp`) claim has been checked, the `iss` (`issuer`) claim value is verified next.
ja_jp: ベアラのJWTトークンの署名が検証され、 `expires at` ( `exp`) のクレームが確認されると、次に `iss` ( `issuer`) クレーム値が検証されます。

source: Once the build is done we can create a new application from the relevant `ImageStream`.
ja_jp: ビルドが完了したら、対応する `ImageStream` から新しいアプリケーションを作成することが出来ます。

source: Once the build is finished, you can run the executable with:
ja_jp: ビルドが完了したら、実行可能ファイルを次のように実行することが出来ます:

source: Once the build is successful, run the below command:
ja_jp: ビルドに成功したら、以下のコマンドを実行します:

source: Once the cluster is configured, you can access it easily as you normally would, for example, by injecting a client instance in your test.
ja_jp: クラスターが設定されたら、通常通り簡単にアクセスできます。たとえば、テストでクライアントインスタンスを注入するなどです。

source: Once the command above has successfully run, you should have an output similar to the one below:
ja_jp: 上記のコマンドが正常に実行されると、以下のような出力が得られるはずです：

source: Once the container is running, you can access the Neo4j browser via http://localhost:7474[http://localhost:7474]. Use `neo4j` as the username and the value of `NEO_PASS` as the password to log in.
ja_jp: コンテナが起動したら、 link:http://localhost:7474[http://localhost:7474] から Neo4j ブラウザにアクセスできます。ユーザー名には `neo4j` を、パスワードには `NEO_PASS` の値を使用してログインします。

source: Once the container is running, you can access the link:http://localhost:7474[Neo4j browser]. Use `neo4j` as the username and the value of `NEO_PASS` as the password to log in.
ja_jp: コンテナーが実行されると、 link:http://localhost:7474[Neo4j ブラウザー] にアクセスできます。ログインする際は、ユーザー名として `neo4j` を使用し、パスワードとして `NEO_PASS` の値を使用します。

source: Once the container is running, you need to ensure that the kernel is ready for the profiling exercises:
ja_jp: コンテナが稼働したら、カーネルがプロファイリングの演習に対応できるようにしておく必要があります。

source: Once the dependencies have been updated, the above class will break the build because the quickstart project is now running with OpenTelemetry. Errors like this will show up in the logs:
ja_jp: 依存関係が更新されると、クイックスタートプロジェクトが OpenTelemetry で実行されているため、上記のクラスはビルドを中断します。以下のようなエラーがログに表示されます。

source: Once the dependency is added to the project, decision tables in `xls` or `xlsx` format can be properly handled.
ja_jp: 依存関係がプロジェクトに追加されると、 `xls` や `xlsx` 形式のディシジョンテーブルを適切に扱うことができます。

source: Once the driver is there, you just need to configure the connection URL.
ja_jp: ドライバーあれば、あとは接続 URL を設定するだけです。

source: Once the extension is there, you will need to explicitly select the `outbox-polling` strategy by setting <<quarkus-hibernate-search-orm-elasticsearch_quarkus-hibernate-search-orm-coordination-strategy,`quarkus.hibernate-search-orm.coordination.strategy`>> to `outbox-polling`.
ja_jp: エクステンションが存在する場合、 <<quarkus-hibernate-search-orm-elasticsearch_quarkus-hibernate-search-orm-coordination-strategy,`quarkus.hibernate-search-orm.coordination.strategy`>> を `outbox-polling` に設定して、 `outbox-polling` ストラテジーを明示的に選択する必要があります。

source: Once the extension is there, you will need to explicitly select the `outbox-polling` strategy by setting link:#quarkus-hibernate-search-orm-elasticsearch_quarkus.hibernate-search-orm.coordination.strategy[`quarkus.hibernate-search-orm.coordination.strategy`] to `outbox-polling`.
ja_jp: エクステンションをインストールしたら、 link:#quarkus-hibernate-search-orm-elasticsearch_quarkus.hibernate-search-orm.coordination.strategy[`quarkus.hibernate-search-orm.coordination.strategy`]を `outbox-polling` に設定し、明示的に `outbox-polling` ストラテジーを選択する必要があります。

source: Once the file is read, the content is stored in an in-memory buffer. We transform this buffer into a String.
ja_jp: ファイルが読み込まれると、その内容がメモリ内のバッファに格納されます。このバッファをStringに変換します。

source: Once the first invocation of the rest client completes, the virtual thread is rescheduled and continues its execution.
ja_jp: RESTクライアントの最初の呼び出しが完了すると、仮想スレッドは再スケジュールされ、実行を継続します。

source: Once the image is compiled, enable and start JFR via runtime flags: `-XX:+FlightRecorder` and `-XX:StartFlightRecording`. For example:
ja_jp: イメージのコンパイルが完了したら、ランタイムフラグ `-XX:+FlightRecorder` と `-XX:StartFlightRecording` を使ってJFRを有効にし、起動します。例えば、以下のようになります。

source: Once the import completes (shouldn't take more than a couple of minutes), go to the Neo4j browser and you'll be able to observe a small summary of the data in the graph:
ja_jp: インポートが完了したら（数分以上かかることはありません）、Neo4jブラウザにアクセスして、データの小さなサマリーをグラフで見ることができます。
